
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/hayas1/tfgh/actions/runs/11800075560)



<pre><code>Apply complete! Resources: 3 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.repositories["tfgh"].github_repository.this: Refreshing state... [id=tfgh]
module.repositories["dyson-rs"].github_repository.this: Refreshing state... [id=dyson-rs]
module.repositories["tfgh"].github_branch.default: Refreshing state... [id=tfgh:main]
module.repositories["dyson-rs"].github_branch.default: Refreshing state... [id=dyson-rs:master]
module.repositories["dyson-rs"].github_issue_label.this["feature"]: Refreshing state... [id=dyson-rs:feature]
module.repositories["tfgh"].github_issue_label.this["bugfix"]: Refreshing state... [id=tfgh:bugfix]
module.repositories["dyson-rs"].github_issue_label.this["documentation"]: Refreshing state... [id=dyson-rs:documentation]
module.repositories["dyson-rs"].github_issue_label.this["maintenance"]: Refreshing state... [id=dyson-rs:maintenance]
module.repositories["tfgh"].github_issue_label.this["documentation"]: Refreshing state... [id=tfgh:documentation]
module.repositories["dyson-rs"].github_repository_ruleset.this: Refreshing state... [id=2589508]
module.repositories["dyson-rs"].github_issue_label.this["bugfix"]: Refreshing state... [id=dyson-rs:bugfix]
module.repositories["tfgh"].github_repository_ruleset.this: Refreshing state... [id=2558597]
module.repositories["tfgh"].github_issue_label.this["breaking"]: Refreshing state... [id=tfgh:breaking]
module.repositories["tfgh"].github_issue_label.this["deps"]: Refreshing state... [id=tfgh:deps]
module.repositories["dyson-rs"].github_issue_label.this["deps"]: Refreshing state... [id=dyson-rs:deps]
module.repositories["tfgh"].github_issue_label.this["maintenance"]: Refreshing state... [id=tfgh:maintenance]
module.repositories["dyson-rs"].github_issue_label.this["refactor"]: Refreshing state... [id=dyson-rs:refactor]
module.repositories["dyson-rs"].github_issue_label.this["breaking"]: Refreshing state... [id=dyson-rs:breaking]
module.repositories["tfgh"].github_issue_label.this["refactor"]: Refreshing state... [id=tfgh:refactor]
module.repositories["tfgh"].github_issue_label.this["feature"]: Refreshing state... [id=tfgh:feature]
module.repositories["tfgh"].github_branch_default.this: Refreshing state... [id=tfgh]
module.repositories["dyson-rs"].github_branch_default.this: Refreshing state... [id=dyson-rs]
module.repositories["tfgh"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=tfgh/.github/labeler.yml]
module.repositories["tfgh"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=tfgh/.github/workflows/labeler.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=dyson-rs/.github/pull_request_template.md]
module.repositories["tfgh"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=tfgh/.github/release.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=dyson-rs/.github/release.yml]
module.repositories["tfgh"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=tfgh/.github/pull_request_template.md]
module.repositories["tfgh"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:tfgh:56]
github_issue_label.manual: Refreshing state... [id=tfgh:manual]
github_issue_label.update-snippets: Refreshing state... [id=tfgh:update-snippets]
github_repository_environment.plan: Refreshing state... [id=tfgh:plan]
github_repository_environment.apply: Refreshing state... [id=tfgh:apply]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repositories["dyson-rs"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"acc3149e00728d2f02fa1fcd1d608f1514e278caea0403824b612f341bf9ddf4\"" -> "W/\"6c9f5f150b5439d0aab0c1f9f60d9ee6cdc70150fa8e37feb7edf573d3800254\""
        id                          = "dyson-rs"
        name                        = "dyson-rs"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["tfgh"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"593c5a001792cf1f30e73b5ef891f4e440537a697e1f70e41eaabe0015fb99f9\"" -> "W/\"b2f4d8a5aa01be8bb95f6e1d7b14110a5266675cf6257b8869633da5586051b5\""
        id                          = "tfgh"
        name                        = "tfgh"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.repositories["dyson-rs"].github_repository_file.this["github/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/labeler.yml"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            feature:
              - head-branch:
                - '^feat/'
                - '^feature/'
            
            breaking:
              - head-branch:
                - '^breaking/'
            
            bugfix:
              - head-branch:
                - '^fix/'
                - '^bugfix/'
                - '^modify/'
            
            refactor:
              - head-branch:
                - '^refactor/'
            
            documentation:
              - changed-files:
                - any-glob-to-any-file:
                  - '**/README.md'
              - head-branch:
                - '^doc/'
                - '^docs/'
                - '^documentation/'
            
            deps:
              - head-branch:
                - '^dep/'
                - '^deps/'
                - '^dependencies/'
            
            maintenance:
              - changed-files:
                - any-glob-to-any-file:
                  - '.github/**'
              - head-branch:
                - '^maintenance/'
                - '^ci/'
                - '^workflow/'
                - '^chore/'
        EOT
      + file                            = ".github/labeler.yml"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "dyson-rs"
      + sha                             = (known after apply)
    }

  # module.repositories["dyson-rs"].github_repository_file.this["github/workflows/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/workflows/labeler.yml"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            name: Pull Request Labeler
            on:
            - pull_request_target
            
            jobs:
              labeler:
                permissions:
                  contents: read
                  pull-requests: write
                runs-on: ubuntu-latest
                steps:
                - uses: actions/labeler@v5
        EOT
      + file                            = ".github/workflows/labeler.yml"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "dyson-rs"
      + sha                             = (known after apply)
    }

  # module.repositories["dyson-rs"].github_repository_pull_request.managed will be created
  + resource "github_repository_pull_request" "managed" {
      + base_ref              = "master"
      + base_repository       = "dyson-rs"
      + base_sha              = (known after apply)
      + body                  = <<-EOT
            - .github/labeler.yml
            - .github/pull_request_template.md
            - .github/release.yml
            - .github/workflows/labeler.yml
        EOT
      + draft                 = (known after apply)
      + head_ref              = "chore/managed-by-terraform"
      + head_sha              = (known after apply)
      + id                    = (known after apply)
      + labels                = (known after apply)
      + maintainer_can_modify = false
      + number                = (known after apply)
      + opened_at             = (known after apply)
      + opened_by             = (known after apply)
      + state                 = (known after apply)
      + title                 = "[auto] snippet files managed by Terraform"
      + updated_at            = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
module.repositories["dyson-rs"].github_repository_file.this["github/labeler.yml"]: Creating...
module.repositories["dyson-rs"].github_repository_file.this["github/workflows/labeler.yml"]: Creating...
module.repositories["dyson-rs"].github_repository_file.this["github/workflows/labeler.yml"]: Creation complete after 5s [id=dyson-rs/.github/workflows/labeler.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/labeler.yml"]: Creation complete after 5s [id=dyson-rs/.github/labeler.yml]
module.repositories["dyson-rs"].github_repository_pull_request.managed: Creating...
module.repositories["dyson-rs"].github_repository_pull_request.managed: Creation complete after 2s [id=hayas1:dyson-rs:9]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":57,"Program":"tfcmt","SHA1":"8150f61bf5d62aeff025c77c3c712d6ac6dac26c","Vars":{},"WorkflowName":"Terraform apply on push"} -->